In [2]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

1.4.2
1.22.3

In [4]:
n_rows = 5
n_cols = 3
cols = ['bil_pecahan', 'bil_bulat', 'bil_angka']
df = pd.DataFrame(np.random.randint(0, 20, (n_rows, n_cols)), columns=cols)

df['bil_pecahan'] = df['bil_pecahan'].astype(float)

df.index = pd.util.testing.makeDateIndex(n_rows, freq='H')
df = df.reset_index()

df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat  bil_angka teks
0 2000-01-01 00:00:00         14.0         13         16    A
1 2000-01-01 01:00:00          3.0         12          2    B
2 2000-01-01 02:00:00         19.0          4          3    C
3 2000-01-01 03:00:00          9.0          2         18    D
4 2000-01-01 04:00:00         12.0          6          4    E

In [5]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
bil_angka               int32
teks                   object
dtype: object

In [6]:
df.select_dtypes(include=['number'])

   bil_pecahan  bil_bulat  bil_angka
0         14.0         13         16
1          3.0         12          2
2         19.0          4          3
3          9.0          2         18
4         12.0          6          4

In [7]:
df.select_dtypes(include=['float'])

   bil_pecahan
0         14.0
1          3.0
2         19.0
3          9.0
4         12.0

In [8]:
df.select_dtypes(include=['int'])

   bil_bulat  bil_angka
0         13         16
1         12          2
2          4          3
3          2         18
4          6          4

In [9]:
df.select_dtypes(include=['object'])

  teks
0    A
1    B
2    C
3    D
4    E

In [10]:
df.select_dtypes(include=['datetime'])

                index
0 2000-01-01 00:00:00
1 2000-01-01 01:00:00
2 2000-01-01 02:00:00
3 2000-01-01 03:00:00
4 2000-01-01 04:00:00

In [11]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat  bil_angka teks
0         14.0         13         16    A
1          3.0         12          2    B
2         19.0          4          3    C
3          9.0          2         18    D
4         12.0          6          4    E